zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxAgbt_bf.h
/** \brief Offset for Ifx_AGBT_TCR_Bits.ARDT */
#define IFX_AGBT_TCR_ARDT_OFF (20u)

/** \brief Length for Ifx_AGBT_TSR_Bits.TXLNUP */
#define IFX_AGBT_TSR_TXLNUP_LEN (1u)

/** \brief Mask for Ifx_AGBT_TSR_Bits.TXLNUP */
#define IFX_AGBT_TSR_TXLNUP_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_TSR_Bits.TXLNUP */
#define IFX_AGBT_TSR_TXLNUP_OFF (0u)

/** \brief Length for Ifx_AGBT_TSR_Bits.FBE */
#define IFX_AGBT_TSR_FBE_LEN (1u)

/** \brief Mask for Ifx_AGBT_TSR_Bits.FBE */
#define IFX_AGBT_TSR_FBE_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_TSR_Bits.FBE */
#define IFX_AGBT_TSR_FBE_OFF (1u)

/** \brief Length for Ifx_AGBT_TSR_Bits.PLK */
#define IFX_AGBT_TSR_PLK_LEN (1u)

/** \brief Mask for Ifx_AGBT_TSR_Bits.PLK */
#define IFX_AGBT_TSR_PLK_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_TSR_Bits.PLK */
#define IFX_AGBT_TSR_PLK_OFF (2u)

/** \brief Length for Ifx_AGBT_TSR_Bits.ATBS */
#define IFX_AGBT_TSR_ATBS_LEN (2u)

/** \brief Mask for Ifx_AGBT_TSR_Bits.ATBS */
#define IFX_AGBT_TSR_ATBS_MSK (0x3u)

/** \brief Offset for Ifx_AGBT_TSR_Bits.ATBS */
#define IFX_AGBT_TSR_ATBS_OFF (3u)

/** \brief Length for Ifx_AGBT_TSR_Bits.CHUP */
#define IFX_AGBT_TSR_CHUP_LEN (1u)

/** \brief Mask for Ifx_AGBT_TSR_Bits.CHUP */
#define IFX_AGBT_TSR_CHUP_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_TSR_Bits.CHUP */
#define IFX_AGBT_TSR_CHUP_OFF (31u)

/** \brief Length for Ifx_AGBT_FCTRL_Bits.WMLVL */
#define IFX_AGBT_FCTRL_WMLVL_LEN (8u)

/** \brief Mask for Ifx_AGBT_FCTRL_Bits.WMLVL */
#define IFX_AGBT_FCTRL_WMLVL_MSK (0xffu)

/** \brief Offset for Ifx_AGBT_FCTRL_Bits.WMLVL */
#define IFX_AGBT_FCTRL_WMLVL_OFF (0u)

/** \brief Length for Ifx_AGBT_TACU_Bits.ACIC */
#define IFX_AGBT_TACU_ACIC_LEN (31u)

/** \brief Mask for Ifx_AGBT_TACU_Bits.ACIC */
#define IFX_AGBT_TACU_ACIC_MSK (0x7fffffffu)

/** \brief Offset for Ifx_AGBT_TACU_Bits.ACIC */
#define IFX_AGBT_TACU_ACIC_OFF (0u)

/** \brief Length for Ifx_AGBT_TACU_Bits.ACIEN */
#define IFX_AGBT_TACU_ACIEN_LEN (1u)

/** \brief Mask for Ifx_AGBT_TACU_Bits.ACIEN */
#define IFX_AGBT_TACU_ACIEN_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_TACU_Bits.ACIEN */
#define IFX_AGBT_TACU_ACIEN_OFF (31u)

/** \brief Length for Ifx_AGBT_FBFLV_Bits.CURLVL */
#define IFX_AGBT_FBFLV_CURLVL_LEN (8u)

/** \brief Mask for Ifx_AGBT_FBFLV_Bits.CURLVL */
#define IFX_AGBT_FBFLV_CURLVL_MSK (0xffu)

/** \brief Offset for Ifx_AGBT_FBFLV_Bits.CURLVL */
#define IFX_AGBT_FBFLV_CURLVL_OFF (0u)

/** \brief Length for Ifx_AGBT_FBFLV_Bits.MAXLVL */
#define IFX_AGBT_FBFLV_MAXLVL_LEN (8u)

/** \brief Mask for Ifx_AGBT_FBFLV_Bits.MAXLVL */
#define IFX_AGBT_FBFLV_MAXLVL_MSK (0xffu)

/** \brief Offset for Ifx_AGBT_FBFLV_Bits.MAXLVL */
#define IFX_AGBT_FBFLV_MAXLVL_OFF (8u)

/** \brief Length for Ifx_AGBT_IRS_Bits.OFW */
#define IFX_AGBT_IRS_OFW_LEN (1u)

/** \brief Mask for Ifx_AGBT_IRS_Bits.OFW */
#define IFX_AGBT_IRS_OFW_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_IRS_Bits.OFW */
#define IFX_AGBT_IRS_OFW_OFF (0u)

/** \brief Length for Ifx_AGBT_IRS_Bits.WM */
#define IFX_AGBT_IRS_WM_LEN (1u)

/** \brief Mask for Ifx_AGBT_IRS_Bits.WM */
#define IFX_AGBT_IRS_WM_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_IRS_Bits.WM */
#define IFX_AGBT_IRS_WM_OFF (1u)

/** \brief Length for Ifx_AGBT_IRS_Bits.HW */
#define IFX_AGBT_IRS_HW_LEN (1u)

/** \brief Mask for Ifx_AGBT_IRS_Bits.HW */
#define IFX_AGBT_IRS_HW_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_IRS_Bits.HW */
#define IFX_AGBT_IRS_HW_OFF (2u)

/** \brief Length for Ifx_AGBT_IRS_Bits.FER */
#define IFX_AGBT_IRS_FER_LEN (1u)

/** \brief Mask for Ifx_AGBT_IRS_Bits.FER */
#define IFX_AGBT_IRS_FER_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_IRS_Bits.FER */
#define IFX_AGBT_IRS_FER_OFF (3u)

/** \brief Length for Ifx_AGBT_IRE_Bits.OFWE */
#define IFX_AGBT_IRE_OFWE_LEN (1u)

/** \brief Mask for Ifx_AGBT_IRE_Bits.OFWE */
#define IFX_AGBT_IRE_OFWE_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_IRE_Bits.OFWE */
#define IFX_AGBT_IRE_OFWE_OFF (0u)

/** \brief Length for Ifx_AGBT_IRE_Bits.WME */
#define IFX_AGBT_IRE_WME_LEN (1u)

/** \brief Mask for Ifx_AGBT_IRE_Bits.WME */
#define IFX_AGBT_IRE_WME_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_IRE_Bits.WME */
#define IFX_AGBT_IRE_WME_OFF (1u)

/** \brief Length for Ifx_AGBT_IRE_Bits.HWE */
#define IFX_AGBT_IRE_HWE_LEN (1u)

/** \brief Mask for Ifx_AGBT_IRE_Bits.HWE */
#define IFX_AGBT_IRE_HWE_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_IRE_Bits.HWE */
#define IFX_AGBT_IRE_HWE_OFF (2u)

/** \brief Length for Ifx_AGBT_IRE_Bits.FERE */
#define IFX_AGBT_IRE_FERE_LEN (1u)

/** \brief Mask for Ifx_AGBT_IRE_Bits.FERE */
#define IFX_AGBT_IRE_FERE_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_IRE_Bits.FERE */
#define IFX_AGBT_IRE_FERE_OFF (3u)

/** \brief Length for Ifx_AGBT_PYCR1_Bits.IPLL25U */
#define IFX_AGBT_PYCR1_IPLL25U_LEN (2u)

/** \brief Mask for Ifx_AGBT_PYCR1_Bits.IPLL25U */
#define IFX_AGBT_PYCR1_IPLL25U_MSK (0x3u)

/** \brief Offset for Ifx_AGBT_PYCR1_Bits.IPLL25U */
#define IFX_AGBT_PYCR1_IPLL25U_OFF (2u)

/** \brief Length for Ifx_AGBT_PYCR1_Bits.ITXOCD25 */
#define IFX_AGBT_PYCR1_ITXOCD25_LEN (2u)

/** \brief Mask for Ifx_AGBT_PYCR1_Bits.ITXOCD25 */
#define IFX_AGBT_PYCR1_ITXOCD25_MSK (0x3u)

/** \brief Offset for Ifx_AGBT_PYCR1_Bits.ITXOCD25 */
#define IFX_AGBT_PYCR1_ITXOCD25_OFF (16u)

/** \brief Length for Ifx_AGBT_PYCR1_Bits.ITXOCD50 */
#define IFX_AGBT_PYCR1_ITXOCD50_LEN (2u)

/** \brief Mask for Ifx_AGBT_PYCR1_Bits.ITXOCD50 */
#define IFX_AGBT_PYCR1_ITXOCD50_MSK (0x3u)

/** \brief Offset for Ifx_AGBT_PYCR1_Bits.ITXOCD50 */
#define IFX_AGBT_PYCR1_ITXOCD50_OFF (18u)

/** \brief Length for Ifx_AGBT_PYCR1_Bits.ITXOCDVR */
#define IFX_AGBT_PYCR1_ITXOCDVR_LEN (2u)

/** \brief Mask for Ifx_AGBT_PYCR1_Bits.ITXOCDVR */
#define IFX_AGBT_PYCR1_ITXOCDVR_MSK (0x3u)

/** \brief Offset for Ifx_AGBT_PYCR1_Bits.ITXOCDVR */
#define IFX_AGBT_PYCR1_ITXOCDVR_OFF (20u)

/** \brief Length for Ifx_AGBT_PYCR2_Bits.TXLDOVS */
#define IFX_AGBT_PYCR2_TXLDOVS_LEN (3u)

/** \brief Mask for Ifx_AGBT_PYCR2_Bits.TXLDOVS */
#define IFX_AGBT_PYCR2_TXLDOVS_MSK (0x7u)

/** \brief Offset for Ifx_AGBT_PYCR2_Bits.TXLDOVS */
#define IFX_AGBT_PYCR2_TXLDOVS_OFF (4u)

/** \brief Length for Ifx_AGBT_PYCR2_Bits.TXOCDSLE */
#define IFX_AGBT_PYCR2_TXOCDSLE_LEN (5u)

/** \brief Mask for Ifx_AGBT_PYCR2_Bits.TXOCDSLE */
#define IFX_AGBT_PYCR2_TXOCDSLE_MSK (0x1fu)

/** \brief Offset for Ifx_AGBT_PYCR2_Bits.TXOCDSLE */
#define IFX_AGBT_PYCR2_TXOCDSLE_OFF (8u)

/** \brief Length for Ifx_AGBT_PYCR2_Bits.TXOCDSL */
#define IFX_AGBT_PYCR2_TXOCDSL_LEN (3u)

